#################################################
# 각 문제 아래에 정답 코드를 입력하세요.
# 문제를 해결하는데 필요한 패키지를 로드하세요.
#
# 소속 : 
# 이름 : 
#
#################################################

## ggplot2 함수, dplyr 함수, ggplot2 패키지의 mpg 데이터를 이용해 문제를 해결하세요.



# Q1. hwy가 높은 순으로 mpg 데이터를 출력하세요.




# Q2. hwy가 30 이상인 audi 자동차를 출력하세요. 




# Q3. hyundai 자동차를 hwy가 높은 순으로 정렬해 출력하세요.





# Q4. drv별 cty 평균을 출력하세요.





# Q5. cty가 가장 낮은 ford 자동차 다섯 대를 출력하세요.






# Q6. cty 평균이 가장 낮은 회사 세 곳을 출력하세요.







# Q7. ford 자동차의 자동차 종류(class)별 고속도로 연비 평균을 내림차순으로 정렬해 출력하세요.







# Q8. audi 자동차 중 고속도로 연비(hwy)와 도시 연비(cty)의 차이가 가장 큰 자동차 일곱대의 데이터를 출력하세요.







# Q9. toyota 자동차를 대상으로, 배기량(displ)과 고속도로 연비(hwy)의 관계를 나타낸 산점도를 출력하세요.






# Q10. mutate()를 이용해 mpg 데이터에 cty 등급을 나타낸 변수를 추가하세요. 

# 등급 기준       등급
# --------------------
# 30 이상          A
# 20 이상 30 미만  B
# 20 미만          C






# Q11. dplyr 함수를 이용해 앞에서 생성한 등급 변수의 빈도표를 출력하세요.





# Q12. qplot()을 이용해 앞에서 생성한 등급 변수의 빈도를 나타낸 막대 그래프를 출력하세요.





